---
type: ElementWorksetFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementWorksetFilter

`Autodesk.Revit.DB.ElementWorksetFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementWorksetFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | WorksetId | 2012 | `public WorksetId WorksetId { get ; }` |